#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraformzure

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.example will be created
  + resource "azurerm_resource_group" "example" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "bridgecrew-poc"
      + tags     = {
          + "git_commit"           = "7aef1f37ff0589b267125f6b88c3542c19e4a5f9"
          + "git_file"             = "terraform/azure/resource_group.tf"
          + "git_last_modified_at" = "2022-05-20 08:08:09"
          + "git_last_modified_by" = "nikolov_p@hotmail.com"
          + "git_modifiers"        = "nikolov_p"
          + "git_org"              = "5kancho"
          + "git_repo"             = "bridgecrew-poc"
          + "yor_trace"            = "c04c08ab-8c06-4cf5-901e-b62fdb060207"
        }
    }

  # azurerm_storage_account.example will be created
  + resource "azurerm_storage_account" "example" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "GRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "eastus"
      + min_tls_version                   = "TLS1_2"
      + name                              = (known after apply)
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "bridgecrew-poc"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "git_commit"           = "7aef1f37ff0589b267125f6b88c3542c19e4a5f9"
          + "git_file"             = "terraform/azure/storage.tf"
          + "git_last_modified_at" = "2022-05-20 08:08:09"
          + "git_last_modified_by" = "nikolov_p@hotmail.com"
          + "git_modifiers"        = "nikolov_p"
          + "git_org"              = "5kancho"
          + "git_repo"             = "bridgecrew-poc"
          + "yor_trace"            = "3041f553-bb6a-4ee2-93ae-debe37dd3d3d"
        }

      + blob_properties {
          + change_feed_enabled      = (known after apply)
          + default_service_version  = (known after apply)
          + last_access_time_enabled = (known after apply)
          + versioning_enabled       = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {

          + hour_metrics {
              + enabled               = true
              + include_apis          = true
              + retention_policy_days = 10
              + version               = "1.0"
            }

          + logging {
              + delete                = false
              + read                  = false
              + retention_policy_days = 10
              + version               = "1.0"
              + write                 = true
            }

          + minute_metrics {
              + enabled               = true
              + include_apis          = true
              + retention_policy_days = 10
              + version               = "1.0"
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # azurerm_storage_account_network_rules.example will be created
  + resource "azurerm_storage_account_network_rules" "example" {
      + bypass                     = [
          + "Metrics",
        ]
      + default_action             = "Deny"
      + id                         = (known after apply)
      + ip_rules                   = [
          + "127.0.0.1",
        ]
      + storage_account_id         = (known after apply)
      + virtual_network_subnet_ids = (known after apply)
    }

  # azurerm_subnet.example will be created
  + resource "azurerm_subnet" "example" {
      + address_prefixes                               = [
          + "10.0.0.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "bridgecrew-poc"
      + resource_group_name                            = "bridgecrew-poc"
      + virtual_network_name                           = "bridgecrew-vn-poc"
    }

  # azurerm_virtual_network.example will be created
  + resource "azurerm_virtual_network" "example" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "bridgecrew-vn-poc"
      + resource_group_name = "bridgecrew-poc"
      + subnet              = (known after apply)
      + tags                = {
          + "git_commit"           = "7aef1f37ff0589b267125f6b88c3542c19e4a5f9"
          + "git_file"             = "terraform/azure/networking.tf"
          + "git_last_modified_at" = "2022-05-20 08:08:09"
          + "git_last_modified_by" = "nikolov_p@hotmail.com"
          + "git_modifiers"        = "nikolov_p"
          + "git_org"              = "5kancho"
          + "git_repo"             = "bridgecrew-poc"
          + "yor_trace"            = "b9fb9537-7b24-4f1d-a8c3-3ea4e4776f15"
        }
    }

  # random_integer.rnd_int will be created
  + resource "random_integer" "rnd_int" {
      + id     = (known after apply)
      + max    = 10000
      + min    = 1
      + result = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @5kancho, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*